import Head from "next/head";
import Header from "../components/Header";
import { Row, Col, List, Breadcrumb } from "antd";
import React, { useState } from "react";
import Author from "../components/Author";
import Footer from "../components/Footer";
import "../static/style/pages/index.scss";
export default function Home() {
  const [mylist, setMylist] = useState(
    [
      {
        title: "50元加入小密圈 胖哥带你学一年",
        context:
          "50元跟着胖哥学一年，掌握程序人的学习方法。 也许你刚步入IT行业，也许你遇到了成长瓶颈，也许你不知道该学习什么知识，也许你不会融入团队，也许...........有些时候你陷入彷徨。 你需要一个强力的队友，你需要一个资深老手，你需要一个随时可以帮助你的人，你更需要一个陪你加速前行的。 我在这个行业走了12年，从后端、前端到移动端都从事过，从中走了很多坑，但我有一套适合程序员的学习方法。 如果你愿意，我将带着你在这个程序行业加速奔跑。分享我学习的方法，所学的内容和一切我的资料。 你遇到的职业问题，我也会第一时间给你解答。我需要先感谢一直帮助我的小伙伴，这个博客能产出300多集免费视频，其中有他们的鼎力支持，如果没有他们的支持和鼓励，我可能早都放弃了。 原来我博客只是录制免费视频，然后求30元的打赏。 每次打赏我都会觉得内疚，因为我并没有给你特殊的照顾，也没能从实质上帮助过你。 直到朋友给我介绍了知识星球，它可以专享加入，可以分享知识，可以解答问题，所以我如获珍宝，决定把打赏环节改为知识服务。我定价50元每年，为什么是50元每年？因为这是知识星球允许的最低收费了。",
      },
      {
        title: "React实战视频教程-技术胖Blog开发(更新04集)",
        context:
          "50元跟着胖哥学一年，掌握程序人的学习方法。 也许你刚步入IT行业，也许你遇到了成长瓶颈，也许你不知道该学习什么知识，也许你不会融入团队，也许...........有些时候你陷入彷徨。 你需要一个强力的队友，你需要一个资深老手，你需要一个随时可以帮助你的人，你更需要一个陪你加速前行的。 我在这个行业走了12年，从后端、前端到移动端都从事过，从中走了很多坑，但我有一套适合程序员的学习方法。 如果你愿意，我将带着你在这个程序行业加速奔跑。分享我学习的方法，所学的内容和一切我的资料。 你遇到的职业问题，我也会第一时间给你解答。我需要先感谢一直帮助我的小伙伴，这个博客能产出300多集免费视频，其中有他们的鼎力支持，如果没有他们的支持和鼓励，我可能早都放弃了。 原来我博客只是录制免费视频，然后求30元的打赏。 每次打赏我都会觉得内疚，因为我并没有给你特殊的照顾，也没能从实质上帮助过你。 直到朋友给我介绍了知识星球，它可以专享加入，可以分享知识，可以解答问题，所以我如获珍宝，决定把打赏环节改为知识服务。我定价50元每年，为什么是50元每年？因为这是知识星球允许的最低收费了。",
      },
      {
        title: "React服务端渲染框架Next.js入门(共12集)",
        context:
          "50元跟着胖哥学一年，掌握程序人的学习方法。 也许你刚步入IT行业，也许你遇到了成长瓶颈，也许你不知道该学习什么知识，也许你不会融入团队，也许...........有些时候你陷入彷徨。 你需要一个强力的队友，你需要一个资深老手，你需要一个随时可以帮助你的人，你更需要一个陪你加速前行的。 我在这个行业走了12年，从后端、前端到移动端都从事过，从中走了很多坑，但我有一套适合程序员的学习方法。 如果你愿意，我将带着你在这个程序行业加速奔跑。分享我学习的方法，所学的内容和一切我的资料。 你遇到的职业问题，我也会第一时间给你解答。我需要先感谢一直帮助我的小伙伴，这个博客能产出300多集免费视频，其中有他们的鼎力支持，如果没有他们的支持和鼓励，我可能早都放弃了。 原来我博客只是录制免费视频，然后求30元的打赏。 每次打赏我都会觉得内疚，因为我并没有给你特殊的照顾，也没能从实质上帮助过你。 直到朋友给我介绍了知识星球，它可以专享加入，可以分享知识，可以解答问题，所以我如获珍宝，决定把打赏环节改为知识服务。我定价50元每年，为什么是50元每年？因为这是知识星球允许的最低收费了。",
      },
      {
        title: "React Hooks 免费视频教程(共11集)",
        context:
          "50元跟着胖哥学一年，掌握程序人的学习方法。 也许你刚步入IT行业，也许你遇到了成长瓶颈，也许你不知道该学习什么知识，也许你不会融入团队，也许...........有些时候你陷入彷徨。 你需要一个强力的队友，你需要一个资深老手，你需要一个随时可以帮助你的人，你更需要一个陪你加速前行的。 我在这个行业走了12年，从后端、前端到移动端都从事过，从中走了很多坑，但我有一套适合程序员的学习方法。 如果你愿意，我将带着你在这个程序行业加速奔跑。分享我学习的方法，所学的内容和一切我的资料。 你遇到的职业问题，我也会第一时间给你解答。我需要先感谢一直帮助我的小伙伴，这个博客能产出300多集免费视频，其中有他们的鼎力支持，如果没有他们的支持和鼓励，我可能早都放弃了。 原来我博客只是录制免费视频，然后求30元的打赏。 每次打赏我都会觉得内疚，因为我并没有给你特殊的照顾，也没能从实质上帮助过你。 直到朋友给我介绍了知识星球，它可以专享加入，可以分享知识，可以解答问题，所以我如获珍宝，决定把打赏环节改为知识服务。我定价50元每年，为什么是50元每年？因为这是知识星球允许的最低收费了。",
      },
    ],
    []
  );
  return (
    <div>
      <Head>
        <title>Home</title>
      </Head>
      <Header />

      <Row className="comm-main" type="flex" justify="center">
        <Col className="comm-left" xs={24} sm={24} md={16} lg={18} xl={14}>
          <div>
            <div className="bread-div">
              <Breadcrumb>
                <Breadcrumb.Item>
                  <a href="/">首页</a>
                </Breadcrumb.Item>
                <Breadcrumb.Item>视频列表</Breadcrumb.Item>
              </Breadcrumb>
            </div>
            <List
              header={<div>最新日志</div>}
              itemLayout="vertical"
              dataSource={mylist}
              renderItem={(item) => (
                <List.Item>
                  <div className="list-title">{item.title}</div>
                  <div className="list-icon">
                    <span className="list-item">
                      <svg
                        t="1599038873297"
                        className="icon"
                        viewBox="0 0 1024 1024"
                        version="1.1"
                        xmlns="http://www.w3.org/2000/svg"
                        p-id="2945"
                        width="15"
                        height="15"
                      >
                        <path
                          d="M941.98897778 960.67887408h-864.1042963c-21.48124445 0-38.83614815-17.3549037-38.83614815-38.83614816V372.55395555c0-21.48124445 17.3549037-38.83614815 38.83614815-38.83614814h864.1042963c21.48124445 0 38.83614815 17.3549037 38.83614814 38.83614814v549.28877037c0 21.48124445-17.3549037 38.83614815-38.83614814 38.83614816z m-825.26814815-77.6722963h786.432V411.3901037h-786.432v471.61647408z"
                          p-id="2946"
                        ></path>
                        <path
                          d="M941.98897778 403.98696297h-864.1042963c-21.48124445 0-38.83614815-17.3549037-38.83614815-38.83614815V154.95016297c0-21.48124445 17.3549037-38.83614815 38.83614815-38.83614815h864.1042963c21.48124445 0 38.83614815 17.3549037 38.83614814 38.83614815V365.15081482c0 21.48124445-17.3549037 38.83614815-38.83614814 38.83614815z m-825.26814815-77.6722963h786.432V193.78631111h-786.432V326.31466667z"
                          p-id="2947"
                        ></path>
                        <path
                          d="M302.40616297 59.07342222h77.67229628v182.04444445h-77.67229628zM661.15508148 59.07342222h77.6722963v182.04444445h-77.6722963zM239.29742222 498.65007408h111.04711111v77.67229629h-111.04711111zM460.5421037 498.65007408h111.04711112v77.67229629h-111.04711112zM681.78678518 498.65007408h111.04711112v77.67229629h-111.04711112zM239.29742222 683.12177778h111.04711111v77.6722963h-111.04711111zM460.5421037 683.12177778h111.04711112v77.6722963h-111.04711112zM681.78678518 683.12177778h111.04711112v77.6722963h-111.04711112z"
                          p-id="2948"
                        ></path>
                      </svg>
                      2020-9-2
                    </span>
                    <span className="list-item">
                      <svg
                        t="1599039086287"
                        className="icon"
                        viewBox="0 0 1036 1024"
                        version="1.1"
                        xmlns="http://www.w3.org/2000/svg"
                        p-id="4826"
                        width="15"
                        height="15"
                      >
                        <path
                          d="M759.466667 891.733333H98.133333c-55.466667 0-98.133333-42.666667-98.133333-98.133333V392.533333c0-55.466667 42.666667-98.133333 98.133333-98.133333h827.733334c55.466667 0 98.133333 42.666667 98.133333 98.133333v234.666667c0 12.8-8.533333 21.333333-21.333333 21.333333s-21.333333-8.533333-21.333334-21.333333V392.533333c0-29.866667-25.6-55.466667-55.466666-55.466666H98.133333c-29.866667 0-55.466667 25.6-55.466666 55.466666v396.8c0 29.866667 25.6 55.466667 55.466666 55.466667h661.333334c12.8 0 21.333333 8.533333 21.333333 21.333333s-8.533333 25.6-21.333333 25.6z"
                          fill="#7162AD"
                          p-id="4827"
                        ></path>
                        <path
                          d="M917.333333 891.733333H823.466667c-12.8 0-21.333333-8.533333-21.333334-21.333333s8.533333-21.333333 21.333334-21.333333h93.866666c34.133333 0 64-29.866667 64-64v-85.333334c0-12.8 8.533333-21.333333 21.333334-21.333333s21.333333 8.533333 21.333333 21.333333v85.333334c0 55.466667-46.933333 106.666667-106.666667 106.666666z"
                          fill="#A495FC"
                          p-id="4828"
                        ></path>
                        <path
                          d="M21.333333 426.666667c-12.8 0-21.333333-8.533333-21.333333-21.333334V264.533333c0-55.466667 42.666667-98.133333 98.133333-98.133333h486.4c55.466667 0 98.133333 42.666667 98.133334 98.133333v21.333334c0 12.8-8.533333 21.333333-21.333334 21.333333s-21.333333-8.533333-21.333333-21.333333v-21.333334c0-29.866667-25.6-55.466667-55.466667-55.466666H98.133333c-29.866667 0-55.466667 25.6-55.466666 55.466666v140.8c0 12.8-8.533333 21.333333-21.333334 21.333334z"
                          fill="#7162AD"
                          p-id="4829"
                        ></path>
                      </svg>
                      技术
                    </span>
                    <span className="list-item">
                      <svg
                        t="1599038699929"
                        className="icon"
                        viewBox="0 0 1024 1024"
                        version="1.1"
                        xmlns="http://www.w3.org/2000/svg"
                        p-id="2634"
                        width="15"
                        height="15"
                      >
                        <path
                          d="M702.08 558.72a469.12 469.12 0 0 0-50.56-210.56 776.64 776.64 0 0 0-105.6-186.56A778.24 778.24 0 0 0 467.2 86.4c-10.88-9.6-37.76-27.2-58.88-44.16S384 28.16 384 50.88c22.72 248-217.92 433.28-261.44 540.16-83.2 208.32 27.2 366.4 224 397.12 26.24 4.16 29.44-4.8 9.92-20.16a192 192 0 0 1-75.52-224c29.44-86.08 103.04-111.04 131.52-250.56 4.48-22.4 22.08-27.52 40.64-11.2a768 768 0 0 1 173.44 234.88c25.92 74.88 38.4 151.36-101.44 248.96-20.48 14.4 8.64 27.52 35.2 24.96C746.88 972.8 930.56 800 928 653.44c0-53.76-51.2-168-112.32-256-13.76-19.52-28.8-16.32-32 6.4-6.08 64-8.32 110.72-56 164.16-15.04 18.88-26.88 13.44-25.6-9.28z"
                          fill="#231F20"
                          p-id="2635"
                        ></path>
                      </svg>
                      5498次
                    </span>
                  </div>
                  <div className="list-context">{item.context}</div>
                </List.Item>
              )}
            />
          </div>
        </Col>

        <Col className="comm-right" xs={0} sm={0} md={7} lg={5} xl={4}>
          <Author />
        </Col>
      </Row>
      <Footer />
    </div>
  );
}
